{
    "id": "VG_1",
    "title": "Video Games List",
    "description": "Placeholder page, please check \"Syntax Quest\" or \"Who Am I\" page... Currently, just a page with me talking about my favorite video games",
    "content": "I have been an avid fan of video games from JRPG, open world exploration, city building, farming simulation, mmorpg and so much more. I have started playing video games at an early age together with my sister and cousins.\n\nIt had became our common connection even today when we have different careers and lives. We would still think back of those fun days and how much we are still having fun playing video games today. Video games have also allowed me to find friends that I consider have been a big part of my life. Kind and great people I met from high school, college and even as a working adult. I might have never have the opportunity to get to know them if it wasn't for us playing the same video games. \n\nSince I am not a person who loves to stay hang outside or travel, video games gives me a chance to escape reality and live so many lives apart from my boring day to day life. If one day, I want to go to explore a fantasy world? I would boot up a world exploration game. Want to save the world? Go play a JRPG. If today I would like to build cities or farms? Or may be you just want to hangout with friends? Video games have the libraries to help you with that. \n\nI could talk a whole day of video games but there are a few that will forever be part of me:\n\nLegend of the Kage - They say you can never forget your first and this is the very first video game I played on our NES. Its a side scrolling ninja game where you would need to save the Shogun's daughter. Yes, it is a ninja Mario game.\n\nPokemon - Although nowadays we may have stayed away from this game because of how it has become, I cannot remember the amount of time me and my cousins have invested in this games as children but we will always remember how we amazed we are and brag about the rare pokemons we captured especially the shiny ones.\n\nZelda - Another franchise that nowadays I may have stayed away from but as a child it gave me a lot of memories. Explore the world? Be a hero? Save the Princess? Battle and Adventure? Zelda  will give it to you.\n\nFire Emblem - My favorite strategy game franchise, although I haven't played the latest release because of too much backlog from games. But I will play it one day, I have not missed one yet. This game has great mechanics and story, especially Awakening, Three Houses and the underrated Fates.\n\nFinal Fantasy Series - From FF1 to Tactics to FF7 Remakes. This franchise has been a part of me, through this I have been a hero, a soldier, an ancient mage, a knight, a rebel, a politician, an isekai'd person ( Yes Tidus, you have been isekai'd deal with it ), a prince and so much more. Maybe some are lesser than the others but I love this franchise overall.\n\nPersona Series - I have never found a game under the name of Persona that I didn't love. JRPG mix with Light novel and monster capture. Great music, story, game mechanics and especially the character personalities / development.\n\nFinal Fantasy XIV - I have to highlight this MMORPG game from the series because this game impacted me so much more. It is the longest game I have played and still playing. Played since 2014 and is eagerly waiting for the next expansion in June 2024. Story, gameplay, world building, the developer's love for their own game and the community whom I found great friends which has been a big part of my life now. \n\nHarvest Moon / Story of Seasons franchise - A game me and my sister played since childhood and still is playing today. Sometimes you just want to live the slow life in the province. Be a farmer, get to know the town people and marry. \n\nChrono Cross - Underrated game, this has great story and 44 playable characters. As a child, it is the game that actually first intrigued me about how each choices, actions and events that happen will have ramifications to the future. How multiple universes can be born and die from simple decisions.\n\nStar Ocean Series - A game about humans advancing scientifically allowing humans to create galactic bases, travel around the universe, interact with aliens. I got hooked into playing this franchise because it reminded me a lot of Star Trek. Although the newer entries have been a bit weaker than the original trilogy. I hope they could recover or fully remake the original trilogy."
}